app/controllers/quote_controller.rb

SELECT "rates".* FROM "rates" WHERE "rates"."customer_id" = $1  [["customer_id", 1]]
SELECT "surcharges".* FROM "surcharges" WHERE "surcharges"."rate_id" = $1  [["rate_id", 37]]
SELECT "discounts".* FROM "discounts" WHERE "discounts"."rate_id" = $1  [["rate_id", 33]]
SELECT "discounts".* FROM "discounts" WHERE "discounts"."rate_id" = $1  [["rate_id", 37]]
---
  def generate_quote
  #retrieve pricing_profile data
    customer_id = params[:customer_id]
    rate = Rate.where(customer_id: customer_id)[0]
    rate_id = rate["id"]

    surcharge = Surcharge.where(rate_id: rate_id)[0]
    raw_discounts = Discount.where(rate_id: rate_id)
    complete_discounts = []

    if raw_discounts
      raw_discounts.each do |discount|