app/controllers/rates_controller.rb

  def create
    rate_profile = params[:rate_profile]
    discounts = rate_profile["discounts"]
    surcharge = rate_profile["surcharge"]

    new_rate = Rate.new do |r|
      r.customer_id = rate_profile["customer_id"]
    end

    new_rate.save!
    rate_id = Rate.last["id"]

    # parse surcharge data
    if surcharge
      new_surcharge = Surcharge.new do |s|
        s.rate_id = rate_id
        s.item_property = surcharge["item_property"]
        s.surcharge_type = surcharge["surcharge_type"]
        s.type_value = surcharge["type_value"]
      end

      new_surcharge.save!
    end

    # parse discount data
    if discounts
      discounts.each do |discount|
---
INSERT INTO "rates" ("customer_id") VALUES ($1) RETURNING "id"  [["customer_id", 2]]
SELECT "rates".* FROM "rates" ORDER BY "rates"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "surcharges" ("item_property", "surcharge_type", "type_value", "rate_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["item_property", "volume"], ["surcharge_type", "monetary"], ["type_value", 1], ["rate_id", 38]]
SELECT "discounts".* FROM "discounts" ORDER BY "discounts"."id" DESC LIMIT $1  [["LIMIT", 1]]

          d.type_value = discount["type_value"]
        end

        new_discount.save!
        discount_id = Discount.last["id"]
---
INSERT INTO "discounts" ("is_flat", "discount_type", "type_value", "rate_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["is_flat", true], ["discount_type", "percentage"], ["type_value", 10], ["rate_id", 37]]
SELECT "discounts".* FROM "discounts" ORDER BY "discounts"."id" DESC LIMIT $1  [["LIMIT", 1]]

            c.start = criteria["start"]
            c.end = criteria["end"]
          end
          new_criteria.save!
---
INSERT INTO "criteria" ("criteria_type", "start", "end", "discount_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["criteria_type", "range"], ["start", 1], ["end", 100], ["discount_id", 25]]